{"weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_5/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_6/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1, 32], "name": "conv2d/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_5/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [3200, 256], "name": "dense/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense/bias"}, {"dtype": "float32", "shape": [256, 1186], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [1186], "name": "dense_1/bias"}]}], "modelTopology": {"keras_version": "2.6.0", "model_config": {"class_name": "Functional", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, null, 200, 1], "name": "the_inputs", "sparse": false}, "name": "the_inputs"}, {"class_name": "Conv2D", "inbound_nodes": [[["the_inputs", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "max_pooling2d", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"groups": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_7"}, {"class_name": "Reshape", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "reshape", "target_shape": [-1, 3200]}, "name": "reshape"}, {"class_name": "Dense", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "name": "dense"}, {"class_name": "Dense", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1186, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}], "output_layers": [["dense_1", 0, 0]], "name": "model", "input_layers": [["the_inputs", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "format": "layers-model"}